Revit 2027 API
Form.AreProfilesConstrained Property
Get/set if the form's profiles are constrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreProfilesConstrained { get; set; }
Public Property AreProfilesConstrained As Boolean
	Get
	Set
public:
property bool AreProfilesConstrained {
	bool get ();
	void set (bool value);
}
member AreProfilesConstrained : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property to 'true' This operation can only be performed on a swept blend form.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace